const ukrainianTranslations = {
  // header
  linkItems: [
    { id: 1, value: 'Про нас', href: '#slider-anchor' },
    { id: 2, value: 'Команда', href: '#leaderParty-anchor' },
    { id: 3, value: 'Про партію', href: 'https://udar.party/' },
    { id: 4, value: 'Контакти', href: '#socialMedia-anchor' },
  ],
  linkButton: [
    {
      id: 1,
      value: 'Приєднатися',
      href: 'https://docs.google.com/forms/d/1m9dcgUMTz4Ze6HTzRzySH7Ivg6-Gk1Y4F8deZZlsB2c/viewform?edit_requested=true&pli=1',
    },
  ],
  linkButtonContact: [
    {
      id: 1,
      value: 'ДОЛУЧИТИСЯ',
      href: 'https://docs.google.com/forms/d/1m9dcgUMTz4Ze6HTzRzySH7Ivg6-Gk1Y4F8deZZlsB2c/viewform?edit_requested=true&pli=1',
    },
  ],
  
  // About
  aboutText: [
    {
      value:
        'Ми впевнені, що молодь - це майбутнє країни, і саме через спільні зусилля, креативність та наполегливість ми можемо досягти позитивних змін.',
    },
  ],

  // slider
  sliderTitle: 'Наша діяльність',

  sliderText: '"Молодь, що змінює світ своїми діями!"',

  // InitialBlockSection
  initialTitle: 'Майбутнє країни в руках молоді!',
  initialText:
    "Ми - молодіжна організація партії 'УДАР'. Наша команда об'єднує енергійних, креативних молодих людей, які хочуть зробити свій внесок у побудову кращого майбутнього для України.",
  initialButton: [
    {
      id: 1,
      value: 'Дізнатися більше',
      href: '#slider-anchor',
    },
  ],
  // about section

  abbrevioInImage: 'М.Д.А.Р',

  aboutText1:
    'Ми впевнені, що молодь - це майбутнє країни, і саме через спільні зусилля, креативність та наполегливість ми можемо досягти позитивних змін.',
  aboutText2:
    'Наша організація пропонує різноманітні можливості для молоді: навчальні програми, тренінги, волонтерські заходи та соціальні проекти. Ми розвиваємо навички лідерства, сприяємо освіті та культурному обміну, а також активно впливаємо на прийняття ключових рішень нашої країни.',
  aboutText3:
    'Наша місія - створити сучасне, сильне та справедливе суспільство, в якому кожен має можливість реалізувати свій потенціал та жити у достатку та гідності. Ми віримо у потужність інновацій, ефективного управління та діалогу між усіма верствами суспільства.',
  aboutText4:
    'У нас немає обмежень за соціальним статусом, вірою чи походженням. Ми відкриті до співпраці з кожним, хто прагне долучитися до змін у нашому суспільстві. Разом ми можемо зробити більше!',

  // LeaderParty section
  leaderPartyTitle: 'Лідер молодіжки партії «УДАР»',
  leaderPartyName: 'Дамір Рахматуллін',
  leaderPartyСitation:
    '"Молодь - це сила, яка може змінити світ. Її енергія і незалежність - ключ до завтрашнього дня."',

  // Policy section

  policyH1: `ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ ПЕРСОНАЛЬНИХ ДАНИХ`,
  policyTextMain_1: `Політична Партія «УДАР (Український Демократичний Альянс за Реформи)`,
  policyTextMain_2:'Віталія Кличка» (далі - Партія)',
  policyTextMain_3:'поважає конфіденційність персональних даних користувачів сайту www.udar.party та докладає всіх зусиль щодо її захисту від неправомірного використання.',
  policyTextMain_4:'«Політика конфіденційності» (далі — Політика)',
  policyTextMain_5:'націлена на публічне інформування про',
  policyTextMain_6:'порядок збору (обробки), зберігання, передачі персональних даних.',
  policyTextMain_7:'Відвідуючи вебсайт Партії, Ви підтверджуєте, що ознайомлені та погоджується з Політикою',
  policyTextMain_8:'конфіденційності та нормами',
  policyTextMain_9:'Закону України «Про захист персональних даних».',
  policyTextMain_10:'У цій Політиці вживаються наступні терміни:',
  policyTextMain_11:'Вебсайт - сукупність вебсторінок та залежного вмісту, доступних у мережі',
  policyTextMain_12:'Інтернет, які обʼєднані як за змістом, так і за навігацією під єдиним доменним імʼям, що знаходиться укористуванні Партії.',
  policyTextMain_13:'Користувач сайту - особа, що зайшла на вебсторінку, та використовує її для власної мети. Зареєстрований користувач сайту - користувач вебсайту, який зареєструвався на сайті, створивши свій обліковий запис у системі за встановленою формою.',
  policyTextMain_14:'Персональні дані - відомості чи сукупність відомостей про фізичну особу, яка ідентифікована або може бути конкретно ідентифікована.',
  policyTextMain_15:'Обробка персональних даних - будь - яка дія або сукупність дій, таких як збирання, реєстрація, накопичення, зберігання, адаптування, зміна, поновлення, використання і поширення, знеособлення, знищення персональних даних, у тому числі з використанням інформаційних(автоматизованих) систем.',


  policyH2_1: `1. ЗБІР | ОБРОБКА ПЕРСОНАЛЬНИХ ДАНИХ`,
  policyText1_1: `Інформація, яку Користувач вебсайту вносить при реєстрації: прізвище, імʼя, по батькові, номер телефону, електронну адресу, адресу проживання (реєстрації), іншу інформацію, зокрема, участь у політичних партіях, громадських обʼєднаннях, сімейний статус, місце роботи, бажання брати участь у розвитку Партії тощо.`,
  policyText1_2: 'Дані, які отримуються про Користувачів сайту за допомогою допоміжних вебресурсів: дата, час, період перебування на сайті, відвідані сторінки, відомості про пристрій та браузер, ІР-адреса, геолокація, Log-файли, інформація про пристрій з якого здійснюється доступ до сайту тощо та файли cookies для збирання персональних даних, зокрема, тип браузера, операційна система, відвідування сторінок на вебсайті, домен інтернет-провайдера тощо.',
  policyText1_3: 'Файли cookies зберігаються у форматі, який не передбачає можливості ідентифікувати особу Користувача.',

  policyH2_2: `2. МЕТА ОБРОБКИ ПЕРСОНАЛЬНИХ ДАНИХ`,
  policyText2_1: `Метою обробки персональних даних є обмін інформації (інформаційних повідомлень, анонсів про події, звітів про діяльність тощо) між Партією та Користувачем. Персональні дані використовуються лише у межах, наданих Користувачем, та з метою визначеною цією Політикою та Статутом Партії.`,
  policyText2_2: 'Персональні дані збираються та обробляються у відповідності до Закону',
  policyText2_3: 'України «Про захист персональних даних». Розголошення персональних даних третім особам можливо лише у встановленому Законом порядку.',
  policyText2_4: 'Надані Користувачем контактні дані (електронна пошта та мобільний номер телефону) використовуються для звʼязку Партії з Користувачами за допомогою виклику на мобільний телефон або за допомогою текстових повідомлень, зокрема, у мережі Інтернет (SMS, Viber, Telegram та інші).',

  policyH2_3: `3. ТЕРМІНИ ЗБЕРІГАННЯ ТА ВИДАЛЕННЯ ПЕРСОНАЛЬНИХ ДАНИХ`,
  policyText3_1: `Файли cookies зберігаються на пристрої Користувача вебсайту. Користувач має право у будь-який момент видалити відповідні файли. Персональні дані, надані`,
  policyText3_2: 'Зареєстрованим користувачем зберігаються на весь період роботи вебсайту, та можуть бути видалені за наступних умов:',
  policyText3_3: '1. За бажанням зареєстрованого Користувача, шляхом направлення повідомлення про необхідність видалення персональних даних з електронної пошти, що належить зареєстрованому Користувачу, на електронну пошту Партії info@udar.party',
  policyText3_4: '2. У разі порушення умов цієї Політики та Статуту Партії, зокрема, у разі нецензурних висловлювань, закликів до повалення конституційного режиму держави, розпалювання расової, міжрелігійної, гендерної ворожнечі, закликів до вбивства та інших дій, направлених на порушення законодавства України адміністратором вебсайту без попередження про це Користувача.',

  policyH2_4: `4. ЗАХИСТ ПЕРСОНАЛЬНХ ДАНИХ`,
  policyText4_1: `Партія вживає заходи виключного правомірного використання персональних даних. Отримані персональні дані піддаються шифруванню на сайті.`,
  policyText4_2: 'Партія вживає всіх заходів, заради забезпечення конфіденційності персональних даних, але попереджає про можливість настання несприятливих наслідків, повʼязаних із проведенням кібератак та іншими форс-мажорними обставинами. Користувач усвідомлює, що внаслідок протизаконних дій інших осіб, конфіденційність може бути втрачена.',

  policyH2_5: `5. ПРАВА КОРИСТУВАЧА ВЕБСАЙТУ`,
  policyText5: `Згідно Закону України «Про захист персональних даних», Користувач може звернутися до Партії із будь-яким питанням щодо використання власних персональних даних і стосовно видалення власних персональних даних із вебсайту.`,
  policyH2_6: `6. ДОСТУП ДО ПЕРСОНАЛЬНИХ ДАНИХ`,
  policyText6_1: `Партія може передавати адресу електронної пошти та номер мобільного телефону третім осіб виключно з метою поширення повідомлень інформаційного характеру, шляхом використання засобів телефонного та електронного звʼязку, служб текстових повідомлень (SMS, Viber, Telegram та інші). Третя особа використовує дані лише в межах надання послуг поширення повідомлень інформаційного характеру.`,
  policyText6_2: 'Користувач може відмовитися від отримання розсилки вказаних повідомлень шляхом переходу за посиланням, що міститься у повідомленні.',

  policyH2_7: `7. РОЗГОЛОШЕННЯ ПЕРСОНАЛЬНИХ ДАНИХ`,
  policyText7: `Партія не надає інформацію про Користувача третім особам без згоди Користувача, передбаченої цією Політикою. Розголошення персональних даних без згоди Користувача допускається лише у порядку, визначеному Законом України «Про захист персональних даних».`,
  policyH2_8: `8. ЗМІНИ ДО ПОЛІТИКИ КОНФІДЕНЦІЙНОСТІ`,
  policyText8: `Умови цієї Політики можуть змінюватися в односторонньому порядку, однак всі зміни не мають зворотної дії в часі.`,
  policyH2_9: `9. ПРИКІНЦЕВІ ПОЛОЖЕННЯ`,
  policyText9_1: `Користувач та Партія за порушення умов Політики несуть відповідальність згідно з нормами цивільного, адміністративного та кримінального законодавства.`,
  policyText9_2:'Усі питання, що не врегульовані Політикою вирішуються відповідно до чинного законодавства.',
  
  // Contact

  contactTitle: 'Контакти',
  location_1: `Головний офіс політичної партії`,
  location_2: `Місцезнаходження юридичної особи: Кловський узвіз, 5, офіс 72, м.Київ, Україна, 01021`,
  LinksText: 'Звязатись у соц. мережах',
  linkItemsContactSupport: 'Онлайн-підтримка',
  boxContactText: 'Кожен з вас важливий!',

  // SocialMedia section
  socialMediaTitle: 'Соціальні мережі',

  // joinToTeam section

  joinTeam:
    'Приєднуйся до нашої команди та стань частиною майбутнього, яке ми разом будуємо для України.',
  joinTeamTitle: 'Разом ми сильніші, разом ми переможемо!',

  //NotFound section

  titleNotFound: 'Сталась якась біда. Сторінка не існує.',
  backToHome: 'Повернутися додому',

  // footer
  copyRight: 'Всі права захищено © 2023 МДАР',
  linkItemsFooterAbout: [
    { id: 1, value: 'Про нас', href: '#slider-anchor' },
    { id: 2, value: 'Лідер', href: '/' },
    { id: 3, value: 'Команда', href: '/' },
    { id: 4, value: 'Історія партії', href: '/' },
  ],
  linkItemsFooterMedia: [
    { id: 1, value: 'Медіа', href: '/' },
    { id: 2, value: 'Новини', href: '/' },
    { id: 3, value: 'Блог', href: '/' },
    { id: 4, value: 'Фотоматеріал', href: '/' },
    { id: 5, value: 'Відеоматеріал', href: '/' },
  ],
  linkItemsFooterContact: [
    { id: 1, value: 'Контакти', href: '#contact-anchor'},
    { id: 2, value: 'Політика конфіденційності ', href: '#policy-anchor' },
  ],

  linkItemsFooterContactMobile: 'Наш номер',
  linkItemsFooterContactEmail: 'Наша пошта',
};

export default ukrainianTranslations;
